#+title: Semacs_Config Version 1.0
#+author: Sean Averhoff
#+created: 2022-04-17
#+startup: OVERVIEW
#+startup: num
#+Setupfile: ~/.dotfiles/emacs/Semacs/straight/repos/org-exsty/styles-html/readtheorg_inline.theme
#+Setupfile: ~/Org/sean-standard-latex-export.org

-----
=Copy Configuration=
#+begin_src shell :results silent

cp -rf ~/.dotfiles/emacs/Semacs/config.org "/mnt/c/Users/averh/OneDrive/Home-Sean/.dotfiles/.config/emacs/Archiv/config-$(date +"%Y%m%d-%H%M%S").org"

#+end_src
-----
** TODO Org-PDF-Tools
#+begin_src emacs-lisp
(use-package org-pdftools
  :ensure t
  :hook (org-mode . org-pdftools-setup-link))
#+end_src

#+RESULTS:
| org-pdftools-setup-link | org-ref-org-menu | evil-collection-mu4e-org-set-header-to-normal-mode | unpackaged/org-mark-read-only | org+-buffer-name-to-title-config | #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] | org-eldoc-load | org-bars-mode | org-appear-mode | (closure ((now 25213 32002 643427 75000) (now 25213 32002 643375 545000) t) nil Beautify Org Checkbox Symbol (setq prettify-symbols-alist (cons '(#+title . 📕) prettify-symbols-alist)) (setq prettify-symbols-alist (cons '(#+created . 📆) prettify-symbols-alist)) (setq prettify-symbols-alist (cons '(#+author . 👤) prettify-symbols-alist)) (setq prettify-symbols-alist (cons '(#+filetags . 📚) prettify-symbols-alist)) (setq prettify-symbols-alist (cons '(#+archive . 📎) prettify-symbols-alist)) (setq prettify-symbols-alist (cons '(#+COLUMNS . 🚥) prettify-symbols-alist)) (setq prettify-symbols-alist (cons '(#+email . 📧) prettify-symbols-alist)) (setq prettify-symbols-alist (cons '(#+Setupfile . 📁) prettify-symbols-alist)) (setq prettify-symbols-alist (cons '(#+startup . 🙈) prettify-symbols-alist)) (setq prettify-symbols-alist (cons '(#+begin_quote . “) prettify-symbols-alist)) (setq prettify-symbols-alist (cons '(#+end_quote . ”) prettify-symbols-alist)) (setq prettify-symbols-alist (cons '(#+TAGS . 127991) prettify-symbols-alist)) (setq prettify-symbols-alist (cons '(#+EXPORT_SELECT_TAGS . 127991) prettify-symbols-alist)) (setq prettify-symbols-alist (cons '(#+EXPORT_EXCLUDE_TAGS . 127991) prettify-symbols-alist)) (prettify-symbols-mode)) | org-clock-load | prettify-symbols-mode | global-prettify-symbols-mode | org-indent-mode | auto-dictionary-mode | turn-on-auto-fill | which-function-mode | visual-line-mode | flyspell-mode | (closure (t) nil evil-org-mode) | org-evil--org-mode-hook-fn | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-fold-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes |

